[
  {
    "name": "Lawrence T. Burke",
    "position": "Goldman Sachs",
    "text": "The overall website structure is well planned and the resources are excellent. AlgoMate has helped in building my concepts of Competitive Programming. The questions database and the tricks and technques discussed through the resources are really good and have helped me solve a lot of problems on different platforms like Codeforces, SPOJ etc. Almost every topic of Data Structures and Algorithms is covered in a very efficient manner. I would recommend anyone willing to improve his/her programming skills to join AlgoMate.",
    "photo": "https://images.unsplash.com/photo-1480455624313-e29b44bbfde1?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTN8fG1hbGV8ZW58MHx8MHx8&w=1000&q=80"
  },
  {
    "name": "Kathryn R. Crosby",
    "position": "Microsoft",
    "text": "I joined AlgoMate to boost my preparation for incoming interns and to learn CP. This website covered all the basics and intermediate concepts in ds and algo. Questions were very interesting and challenging, and their provided solutions helped in implementing long algorithms very concisely and efficiently. Part which I liked the most was the resource content and the news section. I recommend aspiring programmers to not miss the opportunity of studying from by India's best resources at AlgoMate - Your DSA Companion!",
    "photo": "https://images.unsplash.com/photo-1438761681033-6461ffad8d80?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8cmFuZG9tJTIwcGVvcGxlfGVufDB8fDB8fA%3D%3D&w=1000&q=80"
  },
  {
    "name": "Jeff L. Vallecillo",
    "position": "Nutanix",
    "text": "AlgoMate course helped me learn many new topics that I was unfamiliar with and individually would have taken much more time to master. Before attempting questions, I loved reading materials provided by Codeacad, and it helped me solve the problems covering 'standard' ideas related to the topic I went through. After solving a question, I go through its original solution to have an even better clarity. Each of these problems is a unique learning experience covering new ideas and building upon the previous ones. I recommend AlgoMate!",
    "photo": "https://media.istockphoto.com/photos/portrait-of-handsome-latino-african-man-picture-id1007763808?k=20&m=1007763808&s=612x612&w=0&h=q4qlV-99EK1VHePL1-Xon4gpdpK7kz3631XK4Hgr1ls="
  }
]
